[{
    "title": "Thesis/Project Archiving Management System (TPAMS)",
    "authors":[ {"fname":"Jasper" , "lname": "Alcular"},  {"fname": "Shara Mae","lname" : "Ureta"}],
    "keywords": [{"keyword":"documents"},{"keyword": "Archiving"}],
    "department": {"departments":"624559fe3ae8fd8a47a628a0", "deptname": "Electrical and Allied"},
    "course":{"courses": "62455abba4b247aa8e903847","coursecode":"BTIT-LDP"},
    "abstract": "The Thesis/Project Archiving Management System (TPAMS) is responsible to improve the consistency of the document process electronic based system. It can also minimize the accuracy of time in scanning the documents. This project is professional practice or discipline of controlling and governing what are considered the most important records of an organization throughout the records life cycle, which includes from the time such records are conceived through to their eventual disposal. This work includes identifying, classifying, prioritizing, storing, securing, archiving of records. This study proved that our algorithm is more relevant than the default MySQL method by 11.61% and has an average speed of 2.406 sec. (our search engine algorithm) versus 2.722 sec. (MySQL) when searching",
    "publishedAt": "2018"
}, {
    "title": "Dr. Arcadio Santos National High School - School Resource Manangement System (SRMS)",
    "authors":[ {"fname":"Dave", "lname":"Duncab"},  {"fname": "Daniel Allen" , "lname" : "Del Rosario"} , {"fname": "Candice Joy", "lname": "Ballarta"},{"fname": "Allayanah", "lname":"Loyola"}],
    "keywords": [{"keyword":"Resource"},{"keyword": "Management"}],
    "department": {"departments":"624559fe3ae8fd8a47a6289f", "deptname": "Civil and Allied"},
    "course":{"courses": "62455abba4b247aa8e903839","coursecode":"BET-CT"},
    "abstract": "The study aims to aid the school with manual processes which are highly limited due to the health protocols implemented in the time of the pandemic. The projects covers an Online Enrollment, An Inventory System, and a Clearance System that will cover most of the processes online before going to school for inevitable physical activities such as submission of requirements, pick up of books and devices, and return and retrieval of the said resources. The system will also help the people who deal with records since the system will provide tabulated results depending on the format requested for their reports.",
    "publishedAt": "2022"
}, {
    "title": "Online Archiving Thesis System (OATS)",
    "authors":[ {"fname":"Leslie Jayne","lname":" Ayacocho"},  {"fname":"Shekinah Bless","lname":"Galicia"} , {"fname":"Rodralyn","lname":" Lopez"}, {"fname":"Vince Michael","lname":"Lingon"}],
    "keywords": [{"keyword":"thesis"},{"keyword": "archiving"}],
    "department": {"departments":"624559fe3ae8fd8a47a6289e", "deptname": "Basic Arts and Science"},
    "course":{"courses": "62455abba4b247aa8e903834","coursecode":"BTVTEd-ICT-CH"},
    "abstract": "The Online Archiving Thesis System (OATS) is a website that has a catalog of all the theses of graduated students from the Technological University of the Philippines Taguig (TUP-Taguig). The website will provide the title and the abstract of the study for guest users. If guest users want to access the full copy of the research, they will have to register on the website and make a payment for the thesis they want to access through a GCash API that is integrated in the website. If you are a TUP-Taguig student, you only have to register and you will be able to access the full text of the research that is created by similar or related courses and you can view it on the website or by downloading a PDF copy of the research. Only students of similar or related courses can view the full copy. The system will also have a copy-paste citation feature for users to conveniently use to cite in the study. It will be available in APA, IEEE, and MLA. Additionally, the website is going to oversee the borrowing and returning logs of the physical copy of the theses in their respective technology.",
    "publishedAt": "2021"
}]
